[
  {
    "id": 1,
    "category": "Side Dish",
    "title": "The Intermediate Guide to Healthy Food",
    "date": "25 April 2022",
    "views": "126k Views",
    "readTime": "4 mins read",
    "image": "https://i.ibb.co.com/ccSzNxnd/00a9190ddfa332514b43ba0822970ef1973003b7.png",
    "details": "Eating healthy doesn’t have to mean sacrificing flavor or spending hours in the kitchen. This intermediate guide to healthy food takes you one step beyond the basics, exploring ways to create balanced, nutrient-rich meals that actually taste amazing. You’ll learn how to incorporate more whole grains, fresh vegetables, and lean proteins into your daily routine without feeling restricted. The guide also highlights smart cooking techniques such as roasting, steaming, and sautéing to preserve both flavor and nutrients. From colorful Buddha bowls to hearty soups and vibrant side dishes, every recipe is designed to be simple, satisfying, and adaptable for busy lifestyles. We’ll also dive into understanding food labels, portion control, and how to make healthier choices when dining out. Whether you’re meal prepping for the week or cooking a cozy dinner, this guide will inspire you to enjoy every bite mindfully. With a few strategic swaps and a little creativity, healthy eating can become a joyful, sustainable part of your lifestyle rather than a chore. By the end, you’ll have the confidence to make nutritious food choices that fuel your body and elevate your everyday meals."
  },
  {
    "id": 2,
    "category": "Salad",
    "title": "Summer Quinoa Salad Jars with Lemon Dill",
    "date": "25 April 2022",
    "views": "126k Views",
    "readTime": "5 mins read",
    "image": "https://i.ibb.co.com/j971NZ4g/e5da07b09e59559c5805fc67657a7c0cf8fa25d9.png",
    "details": "This refreshing Summer Quinoa Salad in a jar is the perfect way to stay nourished during hot days. Packed with colorful vegetables, fluffy quinoa, and a zesty lemon-dill dressing, it’s a meal prep dream that’s as nutritious as it is convenient. Layered beautifully in glass jars, the salad keeps fresh for days and makes a perfect grab-and-go lunch. Each bite delivers the tangy brightness of lemon paired with the delicate aroma of dill, balanced by crunchy cucumbers, sweet cherry tomatoes, and protein-rich chickpeas. The quinoa provides a hearty texture that keeps you full and energized throughout the day. Not only is this salad gluten-free and vegetarian, but it’s also highly customizable — add feta for creaminess, avocado for richness, or grilled chicken for extra protein. The secret lies in layering: dressing first, hearty ingredients next, and greens on top to keep everything crisp. With its vibrant colors and refreshing taste, this salad captures the essence of summer in every bite. Whether you’re picnicking outdoors or prepping for a busy work week, these salad jars will brighten your day with both flavor and nourishment."
  },
  {
    "id": 3,
    "category": "Side Dish",
    "title": "Caprese Chicken with Smashed Potatoes",
    "date": "25 April 2022",
    "views": "126k Views",
    "readTime": "4 mins read",
    "image": "https://i.ibb.co.com/FkTkRwm2/be992069e68b06db95bfa627bc18c8202d45422d.png",
    "details": "Caprese Chicken with Smashed Potatoes combines two comforting classics into one irresistible dish. Juicy chicken breasts are topped with melted mozzarella, ripe tomatoes, and fragrant basil, creating a flavor profile reminiscent of the beloved Italian Caprese salad. The addition of crispy, golden smashed potatoes on the side turns this meal into a hearty yet elegant option for weeknights or special occasions. A drizzle of balsamic glaze ties everything together with a sweet tang that enhances the fresh ingredients. This dish balances protein, healthy fats, and wholesome carbs beautifully, offering both nourishment and satisfaction. The smashed potatoes add texture contrast — fluffy inside with perfectly crisp edges. You can roast them with garlic and olive oil for extra flavor. It’s simple to prepare yet impressive enough for guests. Plus, it’s gluten-free and adaptable for different diets. Whether served as a family dinner or a side dish at a summer gathering, Caprese Chicken with Smashed Potatoes is sure to become a favorite. It celebrates seasonal ingredients while keeping preparation easy and deliciously rewarding."
  },
  {
    "id": 4,
    "category": "Dessert",
    "title": "Harissa Chickpeas with Whipped Feta",
    "date": "25 April 2022",
    "views": "126k Views",
    "readTime": "6 mins read",
    "image": "https://i.ibb.co.com/7JqGpxbK/60715da3f2863278a563e9f53cc3dc65d7b57a4a.png",
    "details": "Harissa Chickpeas with Whipped Feta is a bold, modern twist on comfort food that perfectly balances heat, creaminess, and crunch. This Mediterranean-inspired dish features tender chickpeas coated in smoky, spicy harissa paste and roasted to golden perfection. The warm chickpeas are then paired with a velvety whipped feta base that cools the heat with its tangy richness. Topped with a drizzle of olive oil, fresh herbs, and a sprinkle of chili flakes, it’s a flavor explosion in every bite. Although it can serve as a side, it’s hearty enough to stand alone as a vegetarian main course. The contrasting textures — creamy, crispy, and smooth — make it both satisfying and visually stunning. Harissa adds a depth of flavor that pairs beautifully with the saltiness of feta, while lemon zest and garlic bring brightness. Serve it with warm pita bread, roasted vegetables, or a simple salad for a complete meal. It’s easy to prepare yet feels gourmet, making it ideal for dinner parties or quick weekday indulgence. Every bite captures the essence of Mediterranean cuisine — bold, wholesome, and utterly delicious."
  },
  {
    "id": 5,
    "category": "Breakfast",
    "title": "Almond Butter Chocolate Chip Zucchini Bars",
    "date": "25 April 2022",
    "views": "126k Views",
    "readTime": "5 mins read",
    "image": "https://i.ibb.co.com/4gPjh50d/31d38a0986ecc64f1750a54603c27ef6ebd61c56.png",
    "details": "These Almond Butter Chocolate Chip Zucchini Bars are the perfect blend of wholesome ingredients and sweet indulgence. Moist, chewy, and packed with hidden veggies, they make an excellent breakfast, snack, or dessert. Grated zucchini adds natural moisture and fiber, while almond butter provides healthy fats and protein. The addition of dark chocolate chips brings just the right amount of sweetness without being overpowering. Unlike traditional baked goods, these bars are made with whole grain or oat flour, making them a nutritious alternative to sugary pastries. They’re gluten-free and can easily be made vegan by swapping the egg for a flaxseed substitute. The flavor combination of nutty almond butter and melty chocolate creates a comforting taste that feels indulgent yet guilt-free. Perfect for meal prep, they store well and make an ideal grab-and-go breakfast for busy mornings. You can also serve them warm with a dollop of Greek yogurt or drizzle of honey for extra decadence. Whether you’re fueling up after a workout or craving a healthy treat, these bars prove that nutritious eating can be deliciously satisfying."
  },
  {
    "id": 6,
    "category": "Vegan",
    "title": "Smoky Beans & Greens Tacos with Aji Verde",
    "date": "25 April 2022",
    "views": "126k Views",
    "readTime": "3 mins read",
    "image": "https://i.ibb.co.com/PGDWzTLW/0b06d35f9f0dc9b8b2a2a863096159d763f50baa.png",
    "details": "Smoky Beans & Greens Tacos with Aji Verde bring a burst of vibrant Latin-inspired flavor to your table. Made entirely vegan, these tacos combine spiced black beans, sautéed kale, and roasted peppers wrapped in warm corn tortillas. The star of the dish is the Aji Verde — a creamy Peruvian green sauce made from cilantro, jalapeño, lime juice, and vegan mayo or avocado. It adds a tangy, slightly spicy punch that elevates every bite. The smoky undertones come from paprika and cumin, giving the beans depth and richness. These tacos are quick to make, high in fiber and plant-based protein, and ideal for weeknight dinners or meal prep. For added crunch, top with pickled onions or shredded cabbage. They’re colorful, satisfying, and incredibly versatile — perfect for vegans and omnivores alike. Each bite balances creaminess, spice, and freshness, creating a meal that’s as nourishing as it is exciting. Whether you’re new to vegan cooking or looking for something flavorful and fun, these tacos are a delicious way to celebrate plant-based ingredients with bold global flair."
  },
  {
    "id": 7,
    "category": "Gluten Free",
    "title": "Sticky Ginger Rice Bowls with Pickled Veg",
    "date": "25 April 2022",
    "views": "126k Views",
    "readTime": "7 mins read",
    "image": "https://i.ibb.co.com/S4Lm0d3b/ae8ba94130923620aa4218146b28c898b0c8213d.png",
    "details": "Sticky Ginger Rice Bowls with Pickled Veg are a delightful mix of textures and flavors that make gluten-free eating feel indulgent. The base of perfectly sticky jasmine rice is infused with fresh ginger and sesame oil for aromatic depth. Topped with crisp, tangy pickled vegetables — like carrots, cucumbers, and radishes — the dish comes alive with vibrant color and crunch. Add sautéed tofu or grilled chicken for extra protein, then finish with a drizzle of soy-free tamari glaze for a sweet-salty balance. The homemade pickles add a probiotic punch that aids digestion, while the ginger boosts immunity and metabolism. Each component complements the other, resulting in a meal that’s as balanced nutritionally as it is visually appealing. Quick to assemble yet bursting with flavor, these rice bowls are perfect for meal prep or a cozy dinner. They’re proof that gluten-free meals don’t have to be bland — they can be fresh, exciting, and deeply satisfying. Every bowl tells a story of comfort, health, and a touch of Asian-inspired elegance."
  },
  {
    "id": 8,
    "category": "Side Dish",
    "title": "Creamy Garlic Sun-Dried Tomato Pasta",
    "date": "25 April 2022",
    "views": "126k Views",
    "readTime": "9 mins read",
    "image": "https://i.ibb.co.com/LdLbR27m/b5402c5b55a16d364ffdd9afcffd1a57e1e75b85.png",
    "details": "This Creamy Garlic Sun-Dried Tomato Pasta is a comforting side dish that can easily double as a main course. The sauce is luxuriously creamy yet surprisingly light, made with sautéed garlic, sun-dried tomatoes, and a touch of Parmesan for richness. Each bite bursts with savory flavor, complemented by a hint of sweetness from the tomatoes. You can use your favorite pasta shape — penne, fettuccine, or fusilli — to soak up every drop of the sauce. For a healthy twist, try whole wheat or gluten-free pasta. The dish comes together in under 30 minutes, making it perfect for busy weeknights or special occasions. Add spinach or grilled chicken for extra texture and nutrients. The sun-dried tomatoes provide depth, while garlic infuses the entire dish with warmth and aroma. It’s creamy comfort food elevated with Mediterranean flair. Pair it with roasted vegetables or a crisp green salad for balance. Whether served as a side or centerpiece, this pasta is proof that simple ingredients can create unforgettable flavor experiences that everyone will love."
  },
  {
    "id": 9,
    "category": "Dairy Free",
    "title": "The Absolute Easiest Spinach and Pizza",
    "date": "25 April 2022",
    "views": "126k Views",
    "readTime": "11 mins read",
    "image": "https://i.ibb.co.com/TdvmrGK/5f460167878920b8ae639325010cfcce869cd6dd.png",
    "details": "The Absolute Easiest Spinach and Pizza is a dairy-free dream that proves you don’t need cheese for a delicious pizza night. The crust is crisp on the outside, soft inside, and topped with a vibrant spinach-garlic mixture that’s both nourishing and flavorful. Instead of cheese, a creamy cashew or almond sauce adds richness and melts beautifully under heat. The result? A golden, bubbling pizza that satisfies even non-vegans. You can customize it with your favorite toppings like mushrooms, olives, or roasted peppers for added texture. Spinach brings iron and freshness, while the sauce ties everything together with a nutty, tangy finish. Ready in under 30 minutes, it’s ideal for weeknight cravings or casual gatherings. Pair it with a simple salad and sparkling water for a complete meal. This recipe celebrates plant-based ingredients without compromise — wholesome, quick, and full of flavor. Once you try it, you’ll realize dairy-free pizza can be every bit as indulgent and satisfying as the traditional version."
  },
  {
    "id": 10,
    "category": "Salad",
    "title": "Sticky Ginger Rice Bowls with Pickled",
    "date": "25 April 2022",
    "views": "126k Views",
    "readTime": "3 mins read",
    "image": "https://i.ibb.co.com/YBzg6vLt/b95d1a82cb7d39819229fcb1035f77dad15ce947.png",
    "details": "This salad-inspired version of Sticky Ginger Rice Bowls with Pickled Vegetables brings freshness to every bite. Combining the heartiness of rice with the crispness of lightly pickled veggies, this dish strikes the perfect balance between comfort and brightness. The base of ginger-scented rice absorbs a soy-lime dressing that adds just the right amount of zing. Colorful veggies like shredded carrots, cucumber ribbons, and radish slices provide crunch and visual appeal. A sprinkle of sesame seeds and fresh herbs adds nutty depth and aroma. You can serve it warm or chilled, making it a great option for lunch boxes or summer picnics. Though inspired by Asian flavors, the ingredients are simple and easily accessible. It’s naturally gluten-free and can be adapted with tofu, shrimp, or tempeh for added protein. Every spoonful delivers a mix of sweet, tangy, and savory sensations. This salad isn’t just healthy — it’s satisfying, vibrant, and a beautiful way to enjoy vegetables with texture and flavor in every bite."
  },
  {
    "id": 11,
    "category": "Soups",
    "title": "The Best Soft Chocolate Chip Cookies",
    "date": "25 April 2022",
    "views": "126k Views",
    "readTime": "4 mins read",
    "image": "https://i.ibb.co.com/ccSzNxnd/00a9190ddfa332514b43ba0822970ef1973003b7.png",
    "details": "Though this recipe might sound like a dessert, these Soft Chocolate Chip Cookies are the ultimate comfort food companion — even for soup nights! Soft, chewy, and packed with melty chocolate chips, they bring warmth and joy to any meal. The secret to achieving their perfect texture lies in the combination of brown sugar and melted butter, which gives them a caramel-like depth of flavor. They stay soft for days, making them ideal for meal prep or gifting. You can easily make them dairy-free by using coconut oil and dark chocolate chips. These cookies pair surprisingly well with rich, creamy soups like tomato bisque or butternut squash, adding a delightful contrast of sweetness. Each bite melts in your mouth, offering nostalgia and comfort in equal measure. Whether you’re baking for family, friends, or yourself, these cookies are timeless crowd-pleasers that never fail to bring a smile. Sometimes, the best dishes are the simplest — and these cookies prove that perfectly."
  },
  {
    "id": 12,
    "category": "Vegetarian",
    "title": "Baked Mozzarella Chicken Rolls",
    "date": "25 April 2022",
    "views": "126k Views",
    "readTime": "6 mins read",
    "image": "https://i.ibb.co.com/20hXVmwm/3b1962dbeb891a693699a5ac96fd9384860ba7ba.png",
    "details": "Baked Mozzarella Chicken Rolls bring Italian comfort straight to your dinner table. This vegetarian-friendly twist replaces meat with thin slices of grilled eggplant or zucchini rolled around a creamy mozzarella and herb filling. Each roll is baked in rich tomato sauce until bubbly and golden. The result is a dish that’s hearty, cheesy, and packed with Mediterranean flavor — yet surprisingly light. Fresh basil, oregano, and a touch of garlic infuse the sauce with depth, while the melty mozzarella creates a satisfying pull in every bite. It’s an elegant yet easy meal that works beautifully for weeknights or gatherings. Serve it alongside garlic bread or a fresh green salad for a balanced plate. High in calcium and packed with antioxidants from the vegetables, it’s a wholesome choice for all ages. Whether you’re vegetarian or simply craving a lighter take on Italian cuisine, these rolls deliver indulgence without heaviness — a comforting meal that’s sure to become a staple."
  },
  {
    "id": 13,
    "category": "Dessert",
    "title": "The Best Avocado Egg Salad",
    "date": "25 April 2022",
    "views": "126k Views",
    "readTime": "10 mins read",
    "image": "https://i.ibb.co.com/Lzj2vMNm/80e4c12e6f2e391d087bd2822c113f42f7f08657.png",
    "details": "Despite its category name, this Avocado Egg Salad is light enough for lunch yet satisfying like a dessert in texture — creamy, rich, and wholesome. Ripe avocados replace traditional mayonnaise, giving this salad a smooth consistency and healthy boost of omega fats. Hard-boiled eggs add protein, while lemon juice and mustard brighten the flavor. Seasoned with salt, pepper, and a hint of paprika, it’s both simple and elegant. Perfect on whole-grain toast, lettuce wraps, or as a dip for crackers, it’s versatile and meal-prep friendly. This salad is also keto-friendly and gluten-free, making it ideal for a range of diets. Avocado’s natural creaminess pairs beautifully with the eggs, creating a luxurious mouthfeel that feels indulgent but is full of nutrients. Add chopped celery or green onions for crunch, or sprinkle chili flakes for spice. Whether you’re looking for a quick snack or a satisfying meal, this Avocado Egg Salad delivers both nourishment and comfort in every bite — fresh, balanced, and effortlessly delicious."
  },
  {
    "id": 14,
    "category": "Vegetarian",
    "title": "The litigants on the screen are not actors (Set 1)",
    "date": "25 April 2022",
    "views": "126k Views",
    "readTime": "7 mins read",
    "image": "https://i.ibb.co.com/VWCfsdyN/7be7aa2752523ec0ae2662fcec2c79aac96f8264.png",
    "details": "This creatively titled vegetarian recipe brings drama to your dinner plate — literally. ‘The litigants on the screen are not actors’ is a playful way of saying everything you see here is real, fresh, and flavor-packed. Set 1 features a combination of roasted vegetables, herbed grains, and a tangy yogurt dressing that unites the dish beautifully. Each component — caramelized carrots, charred bell peppers, and fluffy couscous — contributes its unique texture and taste. The yogurt drizzle adds creaminess without heaviness, while fresh herbs like dill and parsley bring brightness. It’s a vegetarian feast that’s both visually stunning and deeply satisfying. The dish balances comfort with sophistication, making it ideal for a weekend lunch or casual dinner with friends. Packed with fiber, vitamins, and plant-based protein, it’s as nourishing as it is delicious. This recipe celebrates real ingredients, thoughtfully composed, proving that plant-based eating can be both artistic and full of bold, memorable flavors."
  },
  {
    "id": 15,
    "category": "Vegetarian",
    "title": "The litigants on the screen are not actors (Set 2)",
    "date": "25 April 2022",
    "views": "126k Views",
    "readTime": "4 mins read",
    "image": "https://i.ibb.co.com/hJsdF67K/eab2428a8e1a8905f4d379de053343f5ff004e86.png",
    "details": "Set 2 of ‘The litigants on the screen are not actors’ continues the culinary story with a fresh twist on vegetarian comfort food. This version focuses on baked lentil patties served with roasted tomato chutney and a light cucumber-yogurt sauce. The patties are crisp on the outside, tender inside, and seasoned with cumin, coriander, and garlic for depth. The roasted tomato chutney adds sweetness and acidity, balancing the earthy lentils perfectly. This dish highlights how vegetarian meals can be both hearty and gourmet, offering protein, fiber, and flavor in every bite. Ideal for lunch, dinner, or meal prep, it can be served in wraps, bowls, or even as sliders. The yogurt sauce cools the palate while adding creamy contrast. Set 2 showcases creativity through texture and color — golden patties, red chutney, and green herbs blending harmoniously. It’s a dish that feels indulgent yet nourishing, proving once again that plant-based cuisine has endless possibilities for taste and presentation."
  }
]